src/Documents/ПроизводственныйКалендарь/ПроизводственныйКалендарь.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроизводственныйКалендарь</name>
  <registerRecords>InformationRegister.РегистрПроизводственногоКалендаря</registerRecords>
  <attributes>
    <name>Календарь</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаИзмененийКалендаря</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДня</name>
      <type>
        <types>EnumRef.СтатусДня</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/РегистрПроизводственногоКалендаря/РегистрПроизводственногоКалендаря.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РегистрПроизводственногоКалендаря</name>
  <writeMode>RecorderSubordinate</writeMode>
  <dimensions>
    <name>Год</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаИзмененияКалендаря</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусДня</name>
    <type>
      <types>EnumRef.СтатусДня</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ПроизводственныйКалендарь/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	// регистр РегистрПроизводственногоКалендаря
	Движения.РегистрПроизводственногоКалендаря.Записывать = Истина;
	Для Каждого ТекСтрокаТаблицаИзмененийКалендаря из ТаблицаИзмененийКалендаря Цикл
		Движение = Движения.РегистрПроизводственногоКалендаря.Добавить();
		Движение.Год = Год;
		Движение.ДатаИзмененияКалендаря = ТекСтрокаТаблицаИзмененийКалендаря.Дата;
		Движение.СтатусДня = ТекСтрокаТаблицаИзмененийКалендаря.СтатусДня;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
#КонецОбласти
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
